# running in sc_decode_formal_cover/src/
read_verilog -formal -sv formal_defs.svh
read_verilog -formal -sv debug_sc_system_v3_map.svh
read_verilog -formal -sv props_sc_decode.sv
read_verilog -formal -sv sc_decode_formal_tb.sv
prep -top sc_decode_formal_tb

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
